#+TITLE: main panel for org mode 
#+DESCRIPTION: this file is to track projects, track is NOT the main purpose. organizing is
#+TODO: READY PROGRESS(!) | COMP
#+TODO: TODO | DONE

* this is the orgnizer for org mode 
here I will list the main framework of my org documents. 
- scratch pad  file:scratch.org

* ORG MODE routine
- prioritize EVERY tasks in agenda view 
- A: must-do, can't move to any other task if undone.
  process daily bases 

- B: can be postponed, revisit every week. 
- C: extra work, revisit every 2 weeks. can be removed from agenda  
- when to re prioritize
  - sitting in schedule too long: more than 10

** TODO [#A] review tasks 
   SCHEDULED: <2017-09-18 Mon ++1w>
   - State "DONE"       from "TODO"       [2017-09-11 Mon 14:16]
   - State "DONE"       from "TODO"       [2017-09-06 Wed 13:18]
   - State "DONE"       from "TODO"       [2017-08-15 Tue 17:34]
   - State "DONE"       from "TODO"       [2017-07-25 Tue 17:28]
   - State "DONE"       from "TODO"       [2017-07-19 Wed 17:25]
   - State "DONE"       from "TODO"       [2017-06-26 Mon 16:13]
   - State "DONE"       from "TODO"       [2017-06-19 Mon 22:41]
   - State "DONE"       from "TODO"       [2017-06-12 Mon 15:48]
   - State "DONE"       from "TODO"       [2017-06-05 Mon 16:51]
   - State "DONE"       from "TODO"       [2017-05-31 Wed 14:36]
   - State "DONE"       from "TODO"       [2017-05-23 Tue 11:16]
   - State "DONE"       from "TODO"       [2017-05-16 Tue 23:18]
   - State "DONE"       from "TODO"       [2017-05-01 Mon 18:25]
   - State "DONE"       from "TODO"       [2017-04-24 Mon 17:42]
   - State "DONE"       from "TODO"       [2017-04-17 Mon 13:34]
   - State "DONE"       from "TODO"       [2017-04-10 Mon 12:31]
   :PROPERTIES:
   :LAST_REPEAT: [2017-09-11 Mon 14:16]
   :END:
- go through all todo lists 
- check org/scratch 
- relocate tasks 
- overdue tasks:
  - pass the deadline
  - pass the schedule date 

** TODO [#B] clean-up org 
   SCHEDULED: <2017-09-26 Tue ++3w>
   - State "DONE"       from "TODO"       [2017-09-06 Wed 13:19]
   - State "DONE"       from "TODO"       [2017-08-15 Tue 18:14]
   - State "DONE"       from "TODO"       [2017-07-19 Wed 17:25]
   - State "DONE"       from "TODO"       [2017-06-13 Tue 13:51]
   - State "DONE"       from "TODO"       [2017-05-31 Wed 15:14]
   - State "DONE"       from "TODO"       [2017-05-24 Wed 17:42]
   - State "DONE"       from "TODO"       [2017-05-02 Tue 18:21]
   - State "DONE"       from "TODO"       [2017-04-20 Thu 18:09]
   - State "DONE"       from "TODO"       [2017-04-04 Tue 17:58]
   :PROPERTIES:
   :LAST_REPEAT: [2017-09-06 Wed 13:19]
   :END:
* project scratch						    :project:
here are several projects we need to focus on 

** TODO adding a countdown timmer
- requirement
  - portable component
  - adding event name + dealine. 
  - progress bar 
  - integrate with tagging in the future
** TODO tagging systems for todo 
   

** PROGRESS [#C] enhance the github personal website
- [X] better publishing tool, to publish article 


** TODO a text processor 
- the text processor process the text to find new vocabulary 
- shanbay api. 
- analyze the article, get new vocabulary

** PROGRESS online manager enhancement 
   - State "PROGRESS"   from "READY"      [2017-02-11 Sat 14:20]
*** PROGRESS generic visualization
- [X] adding support to leetcode
- [ ] refactoring code, the code generic 
- [ ] research ways to adding visualization

*** TODO [#C] apply admin theme to website 

*** TODO [#B] better notebook management 

*** TODO [#B] adding a editable table
https://bootsnipp.com/snippets/d0lAe


** emacs toolkit 						      :emacs:
*** TODO package the toolkit, make it portable


** TODO emacs GTD						      :emacs:
- daily routine [[ORG MODE routine]]

** READY [#C] portfolio tracker 





** TODO [#A] huichi wang project phase 1
   DEADLINE: <2017-10-31 Tue>
*** DONE go through the business plan 
*** TODO [#B] back-end support 
*** TODO [#C] angular js front end support 





* project KTLO
** TODO [#B] smart button enhancement
- [ ] adding comment 








* online tutorial 
** TODO  coursea


* 读书&写作
** reading							    :reading:
*** design pattern [2/3] 					       :book:
26 tutorials, 15 min each 
file:designpattern.org 

**** TODO [#C] review design pattern				     :review:
     - State "DONE"       from "TODO"       [2017-03-03 Fri 16:49]
     - State "DONE"       from "TODO"       [2017-03-01 Wed 17:24]
     - State "DONE"       from "TODO"       [2017-02-01 Wed 17:25]
     - State "DONE"       from "TODO"       [2016-10-18 Tue 17:16]
     - State "DONE"       from "TODO"       [2016-07-28 Thu 18:46]
     - State "DONE"       from "TODO"       [2016-07-06 Wed 19:07]
     :PROPERTIES:
     :LAST_REPEAT: [2017-03-03 Fri 16:49]
     :END:


*** javascript design pattern.					       :book:
**** TODO read javascript design pattern. 
     - State "DONE"       from "TODO"       [2017-03-08 Wed 17:24]
     - State "DONE"       from "TODO"       [2017-03-03 Fri 16:49]
     - State "DONE"       from "TODO"       [2017-03-01 Wed 17:26]
     - State "DONE"       from "TODO"       [2016-10-10 Mon 17:22]
     CLOCK: [2016-10-10 Mon 17:02]--[2016-10-10 Mon 17:22] =>  0:20
     - State "DONE"       from "TODO"       [2016-08-18 Thu 00:00]
     - State "DONE"       from "TODO"       [2016-08-16 Tue 22:04]
     - State "DONE"       from "TODO"       [2016-08-11 Thu 15:32]
     - State "DONE"       from "TODO"       [2016-08-08 Mon 01:32]
     - State "DONE"       from "TODO"       [2016-08-02 Tue 10:24]
     - State "DONE"       from "TODO"       [2016-07-27 Wed 10:49]
     - State "DONE"       from "TODO"       [2016-07-24 Sun 23:03]
     :PROPERTIES:
     :LAST_REPEAT: [2017-03-08 Wed 17:24]
     :CUSTOM_ID: jsdp
     :END:



*** programming pearls [2/3]					       :book:
8 chapters left 
file:programming_pearls.org 
**** TODO programming pearls read 1 chapter  
     - Note taken on [2016-07-11 Mon 18:11] \\
       this has been delayed for too long.
     - State "DONE"       from "TODO"       [2016-06-30 Thu 10:34]
     - State "DONE"       from "TODO"       [2016-06-02 Thu 13:35]
     - State "DONE"       from "TODO"       [2016-05-09 Mon 12:09]
     :PROPERTIES:
     :LAST_REPEAT: [2016-06-30 Thu 10:34]
     :END:


*** read clean code 						       :book:
**** TODO [#B] clean code review				     :review:
     SCHEDULED: <2017-09-18 Mon .+1m>
     - State "DONE"       from "TODO"       [2017-08-18 Fri 17:15]
     - State "DONE"       from "TODO"       [2017-06-05 Mon 16:51]
     - State "DONE"       from "TODO"       [2017-04-24 Mon 17:59]
     - State "DONE"       from "TODO"       [2017-03-07 Tue 22:21]
     - State "DONE"       from "TODO"       [2016-10-31 Mon 18:32]
     - State "DONE"       from "TODO"       [2016-10-05 Wed 11:16]
     CLOCK: [2016-10-04 Tue 17:37]--[2016-10-05 Wed 11:16] => 17:39
     :PROPERTIES:
     :LAST_REPEAT: [2017-08-18 Fri 17:15]
     :END:
- watch video 
- summarize 


*** TODO [#C] read code complete				       :book:


*** TODO read object oriented thought process			       :book:
    # SCHEDULED: <2016-08-26 Fri .+1w>
    - State "DONE"       from "TODO"       [2016-08-19 Fri 17:57]
    CLOCK: [2016-08-19 Fri 16:58]--[2016-08-19 Fri 17:57] =>  0:59
    - State "DONE"       from "TODO"       [2016-08-08 Mon 01:32]
    - State "DONE"       from "TODO"       [2016-07-29 Fri 15:55]
    CLOCK: [2016-07-29 Fri 15:44]--[2016-07-29 Fri 15:55] =>  0:11
    CLOCK: [2016-07-29 Fri 15:00]--[2016-07-29 Fri 15:14] =>  0:14
    - State "DONE"       from "TODO"       [2016-07-25 Mon 17:49]
    CLOCK: [2016-07-25 Mon 16:52]--[2016-07-25 Mon 17:48] =>  0:56
    - State "DONE"       from "TODO"       [2016-07-22 Fri 00:03]
    :PROPERTIES:
    :LAST_REPEAT: [2016-08-19 Fri 17:57]
    :END:

    

*** PROGRESS [#C] read careercup 150				  :interview:
    - State "PROGRESS"   from "READY"      [2017-02-21 Tue 00:17]
    - State "COMP"       from "PROGRESS"   [2017-02-21 Tue 00:16]
    - State "PROGRESS"   from "READY"      [2017-02-21 Tue 00:11]
    :PROPERTIES:
    :LAST_REPEAT: [2017-02-21 Tue 00:16]
    :END:


*** TODO [#B] leetbook 
    SCHEDULED: <2017-06-17 Sat ++3d>
    - State "DONE"       from "TODO"       [2017-06-13 Tue 14:09]
    :PROPERTIES:
    :LAST_REPEAT: [2017-06-13 Tue 14:09]
    :END:


*** PROGRESS [#C] effective python				       :work:
    SCHEDULED: <2017-07-08 Sat> 
    - State "PROGRESS"   from "READY"      [2017-06-13 Tue 14:10]


** TODO [#A] reflection, writing journal
   SCHEDULED: <2017-08-18 Fri .+3d/5d>
   - State "DONE"       from "TODO"       [2017-08-15 Tue 17:35]
   - State "DONE"       from "TODO"       [2017-07-19 Wed 17:25]
   - State "DONE"       from "TODO"       [2017-06-19 Mon 22:45]
   - State "DONE"       from "TODO"       [2017-06-11 Sun 21:34]
   - State "DONE"       from "TODO"       [2017-06-05 Mon 22:06]
   - State "DONE"       from "TODO"       [2017-05-23 Tue 11:04]
   - State "DONE"       from "TODO"       [2017-05-20 Sat 11:28]
   - State "DONE"       from "TODO"       [2017-05-15 Mon 10:00]
   - State "DONE"       from "TODO"       [2017-05-01 Mon 11:54]
   - State "DONE"       from "TODO"       [2017-04-18 Tue 10:38]
   - State "DONE"       from "TODO"       [2017-04-12 Wed 22:59]
   - State "DONE"       from "TODO"       [2017-04-09 Sun 23:40]
   - State "DONE"       from "TODO"       [2017-04-04 Tue 11:22]
   - State "DONE"       from "TODO"       [2017-03-31 Fri 11:03]
   - State "DONE"       from "TODO"       [2017-03-27 Mon 00:35]
   - State "DONE"       from "TODO"       [2017-03-19 Sun 23:50]
   - State "DONE"       from "TODO"       [2017-03-07 Tue 22:26]
   - State "DONE"       from "TODO"       [2017-02-28 Tue 22:14]
   - State "DONE"       from "TODO"       [2017-02-20 Mon 22:15]
   - State "DONE"       from "TODO"       [2017-02-17 Fri 11:18]
   - State "DONE"       from "TODO"       [2017-02-13 Mon 10:35]
   - State "DONE"       from "TODO"       [2017-02-09 Thu 21:51]
   - State "DONE"       from "TODO"       [2017-02-06 Mon 20:55]
   - State "DONE"       from "TODO"       [2017-02-01 Wed 01:03]
   - State "DONE"       from "TODO"       [2017-01-29 Sun 21:10]
   - State "DONE"       from "TODO"       [2017-01-23 Mon 18:08]
   - State "DONE"       from "TODO"       [2017-01-20 Fri 17:57]
   - State "DONE"       from "TODO"       [2017-01-17 Tue 18:37]
   - State "DONE"       from "TODO"       [2017-01-12 Thu 00:49]
   - State "DONE"       from "TODO"       [2017-01-08 Sun 22:14]
   - State "DONE"       from "TODO"       [2016-12-30 Fri 21:37]
   - State "DONE"       from "TODO"       [2016-12-25 Sun 14:44]
   - State "DONE"       from "TODO"       [2016-12-08 Thu 09:51]
   - State "DONE"       from "TODO"       [2016-10-25 Tue 19:04]
   - State "DONE"       from "TODO"       [2016-10-17 Mon 22:52]
   - State "DONE"       from "TODO"       [2016-10-12 Wed 22:33]
   - State "DONE"       from "TODO"       [2016-10-07 Fri 17:48]
   - State "DONE"       from "TODO"       [2016-09-28 Wed 00:26]
   CLOCK: [2016-09-27 Tue 23:57]--[2016-09-28 Wed 00:26] =>  0:29
   - State "DONE"       from "PROGRESS"   [2016-09-27 Tue 17:35]
   - State "DONE"       from "TODO"       [2016-09-15 Thu 01:05]
   CLOCK: [2016-09-15 Thu 00:57]--[2016-09-15 Thu 01:05] =>  0:08
   - State "DONE"       from "TODO"       [2016-09-13 Tue 00:01]
   - State "DONE"       from "TODO"       [2016-09-13 Tue 00:01]
   CLOCK: [2016-09-12 Mon 22:28]--[2016-09-13 Tue 00:01] =>  1:33
   - State "DONE"       from "TODO"       [2016-09-07 Wed 00:01]
   - State "DONE"       from "TODO"       [2016-09-03 Sat 22:39]
   - State "DONE"       from "TODO"       [2016-09-02 Fri 12:03]
   - State "DONE"       from "TODO"       [2016-09-02 Fri 12:03]
   - State "DONE"       from "TODO"       [2016-08-23 Tue 23:46]
   CLOCK: [2016-08-23 Tue 23:35]--[2016-08-23 Tue 23:46] =>  0:11
   - State "DONE"       from "TODO"       [2016-08-22 Mon 21:04]
   CLOCK: [2016-08-22 Mon 20:53]--[2016-08-22 Mon 21:04] =>  0:11
   - State "DONE"       from "TODO"       [2016-08-21 Sun 22:36]
   CLOCK: [2016-08-21 Sun 22:24]--[2016-08-21 Sun 22:36] =>  0:12
   - State "DONE"       from "TODO"       [2016-08-16 Tue 23:30]
   CLOCK: [2016-08-16 Tue 23:05]--[2016-08-16 Tue 23:30] =>  0:25
   :PROPERTIES:
   :LAST_REPEAT: [2017-08-15 Tue 17:35]
   :STYLE:    habit
   :END:
:LAST_REPEAT: [2016-10-07 Fri 17:48]
- reading past journals
- writing journals 


** TODO [#B] writing blog 
   SCHEDULED: <2017-06-18 Sun ++1w>
   - State "DONE"       from "TODO"       [2017-06-12 Mon 22:17]
   - State "DONE"       from "TODO"       [2017-05-15 Mon 09:57]
   - State "DONE"       from "TODO"       [2017-04-10 Mon 00:04]
   - State "DONE"       from "TODO"       [2017-04-10 Mon 00:04]
   - Note taken on [2017-04-06 Thu 18:07] \\
     write book note
   - State "DONE"       from "TODO"       [2017-04-03 Mon 17:45]
   - State "DONE"       from "TODO"       [2017-03-23 Thu 11:09]
   - State "DONE"       from "TODO"       [2017-03-21 Tue 10:55]
   :PROPERTIES:
   :LAST_REPEAT: [2017-06-12 Mon 22:17]
   :END:



* misc 
** TODO [#C] setting up a auto downloading service 

* leetcode							   :leetcode:
file:leetcode.org
** road map 
- for the first round, focus on medium problems 
- 2 problems each * 16 = 32 

| category         | round 1 (2) | round 2 | round 3 | total |
|------------------+-------------+---------+---------+-------|
| array            | X           |         |         |     2 |
| linked list      | X           |         |         |     2 |
| hash table       | X           |         |         |     2 |
| 2 points         | X           |         |         |     2 |
| binary search    | X           |         |         |     2 |
| tree             | X           |         |         |     2 |
| stack            | X           |         |         |     2 |
| heap             | X           |         |         |     2 |
| bit              |             |         |         |     0 |
| graph            |             |         |         |     0 |
|------------------+-------------+---------+---------+-------|
| math             |             |         |         |     0 |
| sort             |             |         |         |     0 |
| backtracking     |             |         |         |     0 |
| dp               |             |         |         |     0 |
| greedy           |             |         |         |     0 |
| divide & conquer |             |         |         |     0 |
|                  |             |         |         |     0 |
|------------------+-------------+---------+---------+-------|
| Total            |             |         |         |    16 |
#+TBLFM: $5='( + (if (string= $2 "X") 2 0) (if (string= $3 "X") 1 0) (if (string= $4 "X") 1 0))::@19$5=vsum(@2$5..@18$5)


** easy problems	[50%] 					  :interview:
   CLOSED: [2016-05-19 Thu 09:41]
- 50 problems in total 
- do review each week. 
trainning focus:
- no compiling error
*** DONE leetcode 3 problems 
    SCHEDULED: <2016-05-13 Fri>
    - State "DONE"       from "TODO"       [2016-06-15 Wed 19:23]
    - State "DONE"       from "TODO"       [2016-05-09 Mon 20:02]
    - State "DONE"       from "TODO"       [2016-05-05 Thu 19:49]
    :PROPERTIES:
    :LAST_REPEAT: [2016-06-15 Wed 19:23]
    :END:

*** TODO [#B] leetcode easy problem review			     :review:
    DEADLINE: <2017-06-14 Wed ++1w>
    - State "DONE"       from "TODO"       [2017-06-12 Mon 23:06]
    - State "DONE"       from "TODO"       [2016-07-27 Wed 10:59]
    :PROPERTIES:
    :LAST_REPEAT: [2017-06-12 Mon 23:06]
    :END:

** medium
- most important problems 
- 132 in total. 
- appro 80 days. 
*** TODO [#C] leetcode 2 problems medium
    SCHEDULED: <2017-07-02 Sun .+2d>
    - State "DONE"       from "TODO"       [2017-06-30 Fri 15:19]
    - State "DONE"       from "TODO"       [2017-06-14 Wed 10:14]
    - State "DONE"       from "TODO"       [2017-06-11 Sun 21:29]
    - State "DONE"       from "TODO"       [2017-06-08 Thu 18:01]
    - State "DONE"       from "TODO"       [2017-06-06 Tue 18:20]
    - State "DONE"       from "TODO"       [2017-02-28 Tue 22:07]
    - State "DONE"       from "TODO"       [2017-02-28 Tue 00:19]
    - State "DONE"       from "TODO"       [2016-12-22 Thu 11:34]
    - State "DONE"       from "TODO"       [2016-10-28 Fri 18:46]
    - State "DONE"       from "TODO"       [2016-10-27 Thu 18:46]
    - State "DONE"       from "TODO"       [2016-10-26 Wed 10:22]
    - State "DONE"       from "TODO"       [2016-10-24 Mon 20:01]
    - State "DONE"       from "TODO"       [2016-10-18 Tue 18:49]
    - State "DONE"       from "TODO"       [2016-10-17 Mon 22:48]
    - State "DONE"       from "TODO"       [2016-10-12 Wed 13:13]
    - State "DONE"       from "TODO"       [2016-10-11 Tue 18:20]
    - State "DONE"       from "TODO"       [2016-09-14 Wed 17:58]
    CLOCK: [2016-09-14 Wed 17:35]--[2016-09-14 Wed 17:58] =>  0:23
    - State "DONE"       from "TODO"       [2016-08-22 Mon 21:36]
    - State "DONE"       from "TODO"       [2016-08-10 Wed 22:19]
    - State "DONE"       from "TODO"       [2016-08-08 Mon 01:33]
    - State "DONE"       from "TODO"       [2016-08-03 Wed 17:18]
    - State "DONE"       from "TODO"       [2016-07-22 Fri 11:17]
    - State "DONE"       from "TODO"       [2016-06-14 Tue 19:01]
    :PROPERTIES:
    :LAST_REPEAT: [2017-06-30 Fri 15:19]
    :STYLE:    habit
    :CUSTOM_ID: lc1
    :END:      

** TODO leetcode hard problems 
 
** DONE [#C] leetcode review					     :review:
   CLOSED: [2017-06-12 Mon 23:06] SCHEDULED: <2017-06-02 Fri>


   

* finance
** TODO [#A] weekly investment review 
   SCHEDULED: <2017-09-18 Mon ++1w>
   - State "DONE"       from "TODO"       [2017-09-11 Mon 15:11]
   - State "DONE"       from "TODO"       [2017-09-06 Wed 13:18]
   - State "DONE"       from "TODO"       [2017-08-16 Wed 19:21]
   - State "DONE"       from "TODO"       [2017-07-25 Tue 17:28]
   - State "DONE"       from "TODO"       [2017-07-19 Wed 17:26]
   - State "DONE"       from "TODO"       [2017-06-26 Mon 10:32]
   - State "DONE"       from "TODO"       [2017-06-19 Mon 22:41]
   - State "DONE"       from "TODO"       [2017-06-12 Mon 22:20]
   - State "DONE"       from "TODO"       [2017-06-05 Mon 16:51]
   - State "DONE"       from "TODO"       [2017-05-31 Wed 15:21]
   - State "DONE"       from "TODO"       [2017-05-15 Mon 09:05]
   - State "DONE"       from "TODO"       [2017-05-02 Tue 12:03]
   - State "DONE"       from "TODO"       [2017-04-25 Tue 18:11]
   - State "DONE"       from "TODO"       [2017-04-17 Mon 13:34]
   - State "DONE"       from "TODO"       [2017-04-10 Mon 22:00]
   - State "DONE"       from "TODO"       [2017-04-02 Sun 22:45]
   :PROPERTIES:
   :LAST_REPEAT: [2017-09-11 Mon 15:11]
   :END:
- go over the portfolio
- loss & profit 
- plan 


** TODO [#A] monthly investment review
   SCHEDULED: <2017-09-01 Fri ++1m>
   - State "DONE"       from "TODO"       [2017-08-16 Wed 19:21]
   - State "DONE"       from "TODO"       [2017-07-19 Wed 17:25]
   :PROPERTIES:
   :LAST_REPEAT: [2017-08-16 Wed 19:21]
   :END:
** investment							  :investing:
[[file:invest.org]]
*** TODO [#C] learn market scanner 

*** TODO [#C] investment book note 
*** TODO [#C] IB API use 
*** TODO more strategy, program strategy on books 
